#include <stdio.h>
#include <stdlib.h>
int main()
{
    int nc, ns, nw, i, m, n;                                    /*定义字符个数，单词结束判断条件，单词个数，循环变量*/
    int max;                                                    /*定义最长单词的字符数*/
    int p[50];                                                  /*定义单词长度数组*/
    char a[50][50];                                             /*定义单词字符数组*/
    char c;                                                     /*定义输入字符*/
    max = 0;                                                    /*最长单词字符数初始为0*/
    i = 1;                                                      /*单词长度数组下标初始值为1*/
    ns = nc = nw = 0;                                           /*单词判断初始条件，字符个数初始值，单词个数初始值都为0*/
    m = n = 1;                                                  /*单词数组下标初始值为1*/
    while ((c = getchar()) != EOF){                             /*当输入字符不是文件结束符*/
        if ((c >= 'A'&&c <= 'Z') || (c >= 'a'&&c <= 'z')){  /*当输入字符是字母时*/
            ++nc;                                               /*字符个数增加1个*/
            a[m][n] = '*';                                      /*单词数组赋值为星号*/
            ++n;                                                /*本单词数组的二元下标增加1位*/
            ns = 1;                                             /*单词判断为单词内*/
        }
        else if (ns == 1){                                      /*如果输入字符不是字母并且单词判断条件是在单词内*/
            ++nw;                                               /*单词个数增加1位*/
            ++m;                                                /*单词数组一元下标增加1位*/
            p[i] = nc;                                          /*字符个数赋值给单词长度数组*/
            if (nc >= max)                                      /*如果字符个数大于目前单词长度最大值*/
                max = nc;                                       /*当前字符个数赋值给单词长度最大值*/
            ++i;                                                /*单词长度数组下标增加1位*/
            n = 1;                                              /*单词数组二元下标回到初始值*/
            ns = nc = 0;                                        /*单词判断条件和字符个数回到初始值*/
        }
    }
    for (n = max; n >= 1; --n){                                   /*以下循环体是打印单词的垂直直方图，如果单词数组没有赋值星号，则打印空格*/
        for (m = 1; m <= nw; ++m){
            if (a[m][n] == '*'){
                printf("%c  ", a[m][n]);
            }
            else
                printf("   ");
        }
        printf("\n");
    }
    for (i = 1; i <= nw; ++i)                                     /*以下循环体是打印单词个数*/
        printf("%d  ", p[i]);
    printf("\n");
    system("pause");
    return 0;
}
